* Empirical Setting
# NOTE: 10%
# NOTE: Don't repeat stuff from first chapters
# TODO: Reformulate or cite "high renewable content, causing suitable prices,
# this suitable for VPPs" -- False
# Suitable for VPPs to integrate RES providers on a larger scale
# VPP citation?
This research is embedded in the German carsharing and electricity markets.
Germany is a suitable testbed, since it has a comparably high share of
renewables in its energy mix and is pushing for an energy turnaround (German:
/Energiewende/) since 2010 cite:bmu10_energ_concep_envir_sound_reliab_affor
The high renewable energy content in the energy mix causes electricity prices to
be volatile, which makes Germany an attractive location for the use of
VPPs.

Germany is home to the carsharing providers Car2Go[fn:1] and DriveNow[fn:2],
which operate large EV fleets across the globe. It has been argued that electric
carsharing can simultaneously solve several traditional mobility and
environmental problems and are an important element of future smart cities
cite:firnkorn15_free_float_elect_carsh_fleet_smart_cities. Further, it is widely
regarded that the future of mobility will be electric, shared, smart and
eventually autonomous cite:burns13_sustain_mobil,sterling18_three_revol.
Carsharing providers are already contributing to the first two points by
operating large fleets of electric vehicles. This research addresses the third
point: Using electric carsharing fleets to smartly participate in electricity
markets. Carsharing providers, like Car2Go and DriveNow, operate their
carsharing fleets in a free-float model, which allows customers to pick up and
drop vehicles at any place within the operating zone of the provider. Customers
pay by the minute and are offered incentives to park the EVs at charging
stations at the end of their trip.

# NOTE: Further description how data was collected? API, 5 minutes, etc..?
We obtained real-world trip data from Daimler's carsharing service Car2Go.
Additionally, we collected freely available balancing market data from the GCRM
platform website https://regelleistung.net. The data of the EPEX Spot market
have kindly been provided by ProCom GmbH[fn:3] for research purposes. In the
next chapters the different datasets are described, as well the most important
processing steps outlined.

** Electronic Vehicle Fleet Data
# NOTE: Here only desription of data, no general blabla
# TODO: Exact number of EVs
The Car2Go dataset consists of GPS data of around 500 Smart ED3 Fortwo vehicles in
Stuttgart. These subcompact cars are equipped with a 17.6kWh battery and a
standard 3.3kW on-board charger. They fully charge in about six to seven hours
and can reach a maximum driving distance of 145km according to the manufacturer.
When equipped with an additional 22kW fast charger the charging time reduces to
about an hour.

# TODO: Exact number of charging stations, real or infered?
In Table ref:table-car2go-raw the raw data is displayed, as we have obtained it
by Car2Go. The dataset contains spatio-temporal attributes, such as timestamp,
coordinates, and the address of the EVs in 5 minute intervals. Additionally,
status attributes of the interior and exterior are given (not displayed).
Especially relevant for our research is the state of charge ($SoC$, in %) and
information whether the EV is plugged into one of the 380 charging stations in
Stuttgart. Note that the data only contain EVs that are /available for rent/,
i.e., they are not currently rented out by a customer. EVs which are parked at a
charging station are also not available until they have charged up approximately
70 SoC. Individual trips have to be reconstructed using the GPS data of the
cars. The following preprocessing steps have been taken to prepare the data for
further analysis. Table ref:table-car2go-processed depicts the dataset after all
processing steps.

# TODO: Include prices
# NOTE: Not worthy mentioning?
1) Drop unused data columns

   - /ID/: Number plate is already a unique identifier for every EV.
   - /Address/: Different addresses were given from same coordinates. /Latitude,
     Longitude/ was used for locational data instead.
   - /Interior, Exterior/: Status attributes were not used in the analysis of
     this research. Although they could form interesting features for rental
     predictions.
   - /Engine Type/: All EVs in Stuttgart are electric vehicles.
2) Decrease GPS resolution to 10 meters

   The GPS accuracy of private industry sensors is approximately 5 meters under
   open sky, and worse near buildings, bridges and trees[fn:4]. Rental trips are
   identified by changing GPS locations of the EV (See next point). To reduce
   the number of false identified trips, due to GPS measurement errors, the resolution
   is decreased.
   # TODO: Example above and numbers?
3) Determine rental trips

   We infer that a customer rented an EV, if the position coordinates change
   between two data points of the same EV (see Table ref:table-car2go-raw, 4^{th}
   to 5^{th} row). Note that we assume that customer do not undertake trips,
   which begin and end at the exact same location.
   # NOTE: Not using it for analysis yet
4) Infer charging stations

   The GPS location of the EVs is matched with the GPS locations, where an EV
   has been charged at least once in the dataset. We observed that the raw data
   do not show EVs that are parked at charging stations, but are not plugged in.
   This research assumes that all EVs, which are parked at charging stations are
   also plugged in. That is a valid assumption, since in Germany cars are only
   allowed to park at charging station if they are connected to it.
5) Clean data
   - /Service trips/: 999 rental trips were removed that had a trip duration
     longer than the maximum allowed rental time of two days. We assume that
     these trips were /service trips/ undertaken by Car2Go. When the EVs
     returned with a higher SoC (e.g., they have been charged at the car repair
     shop), the previous trip had to be altered to end at a charging station to
     ensure charging consistency.
   - /Incorrectly charged EVs/: 999 EVs were removed that show incorrect
     charging behavior. The data of these EVs showed an increase of more than
     20% SoC between trips or on trips, while not being located at a charging
     station.

# TODO: Explain capacity prediction data?
# TODO: Include real cleaned data and/or examples
#+BEGIN_SRC python :results output :exports none :var trips=145341 trips_gps=147313
print("Number of cleaned trips with GPS rounding: %.d (%.2f%%)" % (trips_gps - trips, 1 - trips/trips_gps))
#+END_SRC

#+RESULTS:
: Number of cleaned trips with GPS rounding: 1972 (0.01%)

# NOTE: Maybe put graph of how/when car2go is parked at charging w/ confidence intervals?
# I.E. Figure 4.7 of cite:kahlen18_elect_vehic_virtual_power_plant_dilem
#+INCLUDE: "~/uni/ma-thesis/template/car2go_tables.tex" export latex

** Balancing Market Data
# TODO: Consistent wording: tender/auction tender period = weekly, daily;
# segments, intervals, products, time windows
In this research, we use market balancing data from the German secondary reserve
market. The following chapter will give an overview of the dataset and
preprocessing steps that were taken. The data encompasses weekly lists of
anonymized bids between 01.06.2016 and 01.01.2018 and a dataset of activated
control reserve in Germany during the same period. For a detailed description
about the market design of balancing markets refer to Chapter
ref:sec-balancing-market.

The bidding data consists of the traded electricity product, the offered
capacity $\Pb{}$ (MW), the capacity price $\cp{}$ ($\emw$), and the
energy price $\ep{}$ ($\emwh$) of each bid. Four different products
are traded, which are a combination of positive control reserve (feed
electricity into the grid) or negative control reserve (take electricity from
the grid) and the provided time segment (peak or non-peak hours). Since negative
prices are allowed on the secondary operating reserve market, the payment
direction is included as well. Moreover, information about the amount of
capacity that was accepted, i.e., either partially or fully, is listed. Bids,
which were not accepted by the TSOs are not listed. An exemplary excerpt of the
dataset is displayed in Table ref:table-operating-reserve.

#+CAPTION[Secondary Operating Reserve Market Data]: List of Bids of the German Secondary Reserve Market for the tender period 04.12.2017 - 11.12.2017. label:table-operating-reserve
#+ATTR_LATEX: :environment longtable :align c|ccccc :placement [hp]
|---------+----------------+--------------+---------------+---------+----------|
|---------+----------------+--------------+---------------+---------+----------|
| Product | Capacity Price | Energy Price | Payment       | Offered | Accepted |
|---------+----------------+--------------+---------------+---------+----------|
| NEG-HT  |              0 |          1.1 | TSO to bidder |       5 |        5 |
| NEG-HT  |          10.73 |          251 | TSO to bidder |      15 |       15 |
| NEG-HT  |          200.3 |          564 | TSO to bidder |      22 |       22 |
| ...     |            ... |          ... | ...           |     ... |      ... |
| NEG-NT  |              0 |         21.9 | Bidder to TSO |       5 |        5 |
| NEG-NT  |              0 |         22.4 | Bidder to TSO |       5 |        5 |
| ...     |            ... |          ... | ...           |     ... |      ... |
| POS-NT  |          696.6 |         1200 | TSO to bidder |       5 |        5 |
| POS-NT  |         717.12 |         1210 | TSO to bidder |      10 |        7 |
|---------+----------------+--------------+---------------+---------+----------|
|---------+----------------+--------------+---------------+---------+----------|

In this study, we assume that bidding on 15-minute intervals in secondary
operating reserve auctions will be possible in future energy markets. As
mentioned in Chapter ref:sec-balancing-market, the market design of the GCRM
secondary operating reserve tender was adjusted in 2017. Daily tenders with
4-hour bidding intervals were introduced in favor of weekly tenders with only
two time segments. This change represents the trend by the TSOs to change the
market design in order to better include RES into the operating reserve markets
cite:agricola14_dena_ancil_servic_study. Due to the volatility of renewable
electricity generation, providers are naturally dependent on accurate short-term
forecasts, which are only possible with short tender periods and fine-grained
bidding intervals.

# NOTE: Mentioned Ascending order of bids
# TODO: Mention assumption that bids >== critical price get accepted
# Here or in bidding strategy section?
In order to estimate the upper bound of profits that the EV fleet can earn by
participating in the secondary operating reserve market, the /critical prices/
$\ccp{}$ and $\cep{}$ were determined for each auctioned interval. Following
textcite:brandt17_evaluat_busin_model_vehic_grid_integ, we define $\ccp{}$
($\emw$) as the capacity price of the bid that was just barely
accepted, whereas $\cep{}$ ($\emwh$) is the highest energy price
that was payed for activated control reserve during that interval. For every
15-minute interval within the given tender period of one week, the activated
control reserve in that interval was matched with the accepted bids in that
tender period. At the point where supply, i.e., offered capacity of bids, met
demand, i.e., activated control reserve, the critical price $\cep{}$ was
determined.

/Example/: The assumed critical prices for the secondary operating reserve
tender interval of the 6^{th} December 2017 between 08:00 and 08:15 are obtained
as follows: Three suppliers submitted a reserve capacity of 5MW, 15MW and 22MW
respectively (see Table ref:table-operating-reserve). The critical capacity
price $\ccp{}\!=\!200.3\emw$ is determined by the capacity price of the last
(third) accepted bid in that time segment. The TSO reported that 18MW of control
reserve were activated between 08:00 and 08:15. Hence, the second bid determines
the critical energy price $\cep{}\!=\!251\emwh$, as control reserve capacity
gets activated according to ascending order of the submitted energy prices. In
this example the second bidder would get compensated with:
$R\!=\!R^c + R^e\!=\!(10.73\emw\!\times\!15\mw) +
(251\emwh\!\times13\mw\!\times\!0.25\text{h})\!=\! 976.7\eur$. Note that
the second bidder get compensated for providing 13MW for 15 minutes (0.25h),
instead of the submitted 15MW, since in total only 18MW of control capacity was
activated, which was partly fulfilled by the 5MW of the first bidder.

#+BEGIN_SRC python :exports none
    return((10.73*15)+(251*13*0.25))
#+END_SRC

#+RESULTS:
: 976.7
** Spot Market Data
# # TODO: Trading windows times, Other types of orders, How are trades matched (equal, lower, higher)

The data from the EPEX Spot Intraday Continuous encompass order books and
executed trades from 01.06.2016 until 01.01.2018. The list of trades contain
information on the unit price $\up{}$ ($\emwh$), the quantity (kW)
and the traded product (hourly, quarterly or block). In this research, we focus
on quarterly product times (15-minute intervals), as they provide the highest
flexibility. Fleet controllers can promptly react to fluctuant electricity
demand of the EV fleet by accurately adjusting the bid quantities. Future
research could also consider other electricity products if lower prices justify
decreased flexibility at that point in time. Additionally, the TSOs of the buyer
and seller are listed in the dataset. They are only relevant if special
conditions between TSO apply, e.g., when delivering electricity to other
countries.

On the spot market, electricity trades can have a very short lead time of up to
5 minutes before delivery (see Table ref:table-spot-market). This market
characteristic is beneficial for our proposed trading strategy, since it allows
the EV to procure electricity in almost real time. The controller can submit
bids to the market, with accurate estimations of available charging capacity up
to five minute-ahead. Similarly to the balancing market, the critical price
$\cup{}$ has to be determined for all intraday trading intervals.
$\cup{}$ is defined as the lowest unit price of all executed trades
$\cal{T}$ in a bidding interval:
\begin{equation*}
    \cup{} \defeq \min_{t \in \cal{T}} \up{t}
\end{equation*}
Note that $\cup{}$ is essentially the optimal bidding price, it provides
on upper bound for the fleets profits when bidding on the intraday market. We
assume that bids with  $p_u \geq \cup{}$ will always get matched. In
reality this is not always the case, since trades are executed immediately and
it is not guaranteed that unmatched asks at $\cup{}$ exist at the time
of commitment. For a detailed description of the intraday continuous market see
Chapter ref:sec-spot-market.

#+LATEX: {\captionsetup[table]{aboveskip=0.5cm}
#+CAPTION: List of Trades of the EPEX Spot Intraday Continuous Market label:table-spot-market
#+ATTR_LATEX: :float sideways :align c|cccccccc :placement [hp]
|---------------------+---------+------------+----------+------------+-------------+---------+---------------+---------------|
|---------------------+---------+------------+----------+------------+-------------+---------+---------------+---------------|
| Execution time      |      ID | Unit Price | Quantity | Buyer Area | Seller Area | Product | Product Time  | Delivery Date |
|---------------------+---------+------------+----------+------------+-------------+---------+---------------+---------------|
| 2017-12-04 06:54:55 | 8031392 |      51.00 |     5500 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:53:26 | 8031391 |      59.00 |    10000 | TenneT     | TenneT      | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:53:26 | 8031390 |      58.90 |    10000 | TenneT     | TenneT      | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:53:15 | 8031389 |      52.30 |     7000 | 50Hertz    | 50Hertz     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:53:13 | 8031386 |      59.00 |      500 | TenneT     | TenneT      | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:53:13 | 8031387 |      51.00 |     3600 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:53:13 | 8031388 |      52.00 |     1400 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:53:02 | 8031385 |      58.90 |    11000 | TenneT     | TenneT      | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:52:38 | 8031380 |      60.00 |    10000 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:52:38 | 8031381 |      57.50 |     8000 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:52:38 | 8031382 |      58.00 |     2000 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:52:38 | 8031383 |      58.90 |     4000 | TenneT     | TenneT      | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:52:38 | 8031384 |      60.00 |     4000 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:52:27 | 8031379 |      52.30 |     8000 | 50Hertz    | 50Hertz     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:51:33 | 8031378 |      66.00 |     5000 | TransnetBW | TransnetBW  | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:51:28 | 8031377 |      54.00 |     8000 | Amprion    | Amprion     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:51:24 | 8031376 |      54.00 |     7000 | TenneT     | TenneT      | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:49:34 | 8031375 |      51.00 |     4000 | TenneT     | TenneT      | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:49:26 | 8031374 |      54.00 |     5000 | 50Hertz    | 50Hertz     | Q       | 07:15 - 07:30 |    2017-12-04 |
| 2017-12-04 06:49:23 | 8031373 |      55.10 |     8000 | 50Hertz    | 50Hertz     | Q       | 07:15 - 07:30 |    2017-12-04 |
|---------------------+---------+------------+----------+------------+-------------+---------+---------------+---------------|
|---------------------+---------+------------+----------+------------+-------------+---------+---------------+---------------|
#+LATEX:}

#+LATEX: \clearpage

* Footnotes

[fn:1] https://www.car2go.com

[fn:2] https://www.drive-now.com

[fn:3] https://procom-energy.de

[fn:4] See https://www.gps.gov/systems/gps/performance/accuracy, accessed
23^{th} February 2019.
